myDatart/myDatart-erpUpdate/src/test/resources/soaps/updateExpressOrder-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bam="http://etnetera.com/projects/datart/bambino" >
     <soapenv:Header/>
   <soapenv:Body>
         <bam:updateExpressOrder>
             <segment>CZ</segment>
         <order>
                 <id>140488664</id>
            <orderType>ESHOP</orderType>
            <contacts>
                     <email>monixa@centrum.cz</email>
               <phone/>
               <cellularPhone>774417963</cellularPhone>
            </contacts>
            <totalPrice>599.00</totalPrice>
            <billingAddress>
                     <firstName>Monika</firstName>
               <lastName>Sládková</lastName>
               <street/>
               <zip/>
               <city/>
               <country/>
            </billingAddress>
            <shippingAddress>
                     <firstName>Monika</firstName>
               <lastName>Sládková</lastName>
               <street/>
               <zip/>
               <city/>
               <country/>
            </shippingAddress>
            <items>
                     </items>
            <deliveries>
                     </deliveries>
            <partialDelivery>true</partialDelivery>
            <state>OPEN</state>
            <dateCreated>2015-04-15T22:11:58.000+02:00</dateCreated>
            <dateChanged>2015-04-15T22:12:30.000+02:00</dateChanged>
         </order>
      </bam:updateExpressOrder>
   </soapenv:Body>
</soapenv:Envelope>